# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-seg-C3k2-DCNv4-SimAM-Single instace segmentation model
# Features:
# 1. DCNv4: Geometric transformation for occlusion handling (Backbone P5 + Neck).
# 2. SimAM: Parameter-free attention for feature refinement (Only after C2PSA).

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-seg.yaml' will call yolo11-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 203 layers, 2876848 parameters, 2876832 gradients, 10.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 203 layers, 10113248 parameters, 10113232 gradients, 35.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 253 layers, 22420896 parameters, 22420880 gradients, 123.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 379 layers, 27678368 parameters, 27678352 gradients, 143.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 379 layers, 62142656 parameters, 62142640 gradients, 320.2 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_DCNv4, [1024, True]] # 8 (DCNv4 at deepest level)
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 (Standard Attention)
  - [-1, 1, SimAM, [1e-4]] # 11 (SimAM Refinement after C2PSA)

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]] # 13 cat backbone P4
  - [-1, 2, C3k2_DCNv4, [512, False]] # 14 (DCNv4 Neck)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 2, C3k2_DCNv4, [256, False]] # 17 (DCNv4 Neck P3)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19 cat head P4 (Output of Layer 14)
  - [-1, 2, C3k2_DCNv4, [512, False]] # 20 (DCNv4 Neck P4)

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]] # 22 cat head P5 (Output of Layer 11 - SimAM Refined)
  - [-1, 2, C3k2_DCNv4, [1024, True]] # 23 (DCNv4 Neck P5)

  - [[17, 20, 23], 1, Segment, [nc, 32, 256]] # 24 Detect(P3_, P4_, P5_)
